# Задача №49. Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt. Фамилия, 
# имя, отчество, номер телефона - данные, которые должны находиться в файле.
# 1. Программа должна выводить данные
# 2. Программа должна сохранять данные в текстовом файле
# 3. Пользователь может ввести одну из характеристик для поиска определенной записи (Например имя или фамилию человека)
# 4. Использование функций. Ваша программа не должна быть линейной

# Задача 38: Дополнить телефонный справочник возможностью изменения и удаления данных. Пользователь также может 
# ввести имя или фамилию, и Вы должны реализовать функционал для изменения и удаления данных.

# Справочник
phone_directory= [
    ['+7 913 884 30 09', 'Васильев', 'Василий', 'Савельевич'], 
    ['+7 983 098 35 59', 'Таразанов', 'Семен', 'Васильевич'], 
    ['+7 969 983 98 34', 'Прокин', 'Петр', 'Николаевич'], 
    ['+7 953 990 34 54', 'Добрынин', 'Тихон', 'Афанасьевич'] 
]

# print(phone_directory)
