# -*- coding: utf-8 -*-
"""Untitled3.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1SzJvi9p92FkZLSXTJ8Tl92T12hpeeYr4

#Задача №61. 
1. Определить какое максимальное и минимальное значение median_house_value
2. Показать максимальное median_house_value, где median_income = 3.1250
3. Узнать какая максимальная population в зоне минимального значения median_house_value
"""

import pandas as pd

df = pd.read_csv('sample_data/california_housing_test.csv')

"""1. Определить какое максимальное и минимальное значение median_house_value"""

print(df['median_house_value'].max())

print(df['median_house_value'].min())

"""2. Показать максимальное median_house_value, где median_income = 3.1250"""

df['median_house_value'][df['median_income'] == 3.1250].max()

"""3. Узнать какая максимальная population в зоне минимального значения median_house_value"""

df.loc[df['median_house_value']==df['median_house_value'].min(),'population'].max()